---
---

<center><h1> üìç üìç Sorting the Data üìç üìç </h1></center>

---

In this notebook, we will see how to sort the data based on a single column and on multiple columns. Also we will see how to reset index after sorting the data.

---

In [0]:
# import the pandas library
import pandas as pd

 ---

#### `CREATE A SAMPLE DATAFRAME`


- We will create a sample data of students that will contain `roll_no`, `name`, `grade`, `marks` and `city`. 


---

In [0]:
# sample dataframe
data_frame = pd.DataFrame({
    'roll_no': [ 102, 101, 104, 103, 105],
    'name' : ['Aravind', 'Rahul', 'Prateek', 'Piyuesh', 'Kartik'],
    'grade': ['B', 'B', 'A', 'C', 'A'],
    'marks': [ 15, 15, 20, 4, 22],
    'city' : ['Gurugram', 'Delhi', 'Delhi', 'Gurugram', 'Hyderabad']
})

data_frame

   roll_no     name grade  marks       city
0      102  Aravind     B     15   Gurugram
1      101    Rahul     B     15      Delhi
2      104  Prateek     A     20      Delhi
3      103  Piyuesh     C      4   Gurugram
4      105   Kartik     A     22  Hyderabad

---

#### `SORT THE DATAFRAME BY THE GRADES OF THE STUDENT` 


- Now, we need to sort the students based on their grades. We will use the **`sort_values`** function and in the parameter by we will pass the column **`grade`**. 

---

In [0]:
# sort the data
data_frame.sort_values(by=['grade'])

   roll_no     name grade  marks       city
2      104  Prateek     A     20      Delhi
4      105   Kartik     A     22  Hyderabad
0      102  Aravind     B     15   Gurugram
1      101    Rahul     B     15      Delhi
3      103  Piyuesh     C      4   Gurugram

---

- Now, that we have sorted the data based on the grades. You can see that some of the students with higher marks are ranked lower even having the same marks. So, we want to sort the data based on both grades and marks.

- Also, the grades should be in ascending order and marks should be in descending order.


---

---

#### `SORT THE DATAFRAME BY GRADE AND MARKS OF THE STUDENTS`


- To sort the values in the descending order, we need to set parameter `ascending = False`.
- In the by parameter pass the list of columns on which we want to sort and for the ascending parameter pass the boolean list `True for ascending` and `False for descending`.

---

In [0]:
# sort the dataframe
data_frame.sort_values(by=['grade','marks'],ascending=[True,False])

   roll_no     name grade  marks       city
4      105   Kartik     A     22  Hyderabad
2      104  Prateek     A     20      Delhi
0      102  Aravind     B     15   Gurugram
1      101    Rahul     B     15      Delhi
3      103  Piyuesh     C      4   Gurugram

---

***Now, let's see the dataframe.***

In [0]:
data_frame

   roll_no     name grade  marks       city
0      102  Aravind     B     15   Gurugram
1      101    Rahul     B     15      Delhi
2      104  Prateek     A     20      Delhi
3      103  Piyuesh     C      4   Gurugram
4      105   Kartik     A     22  Hyderabad

***Now, you can observe that the sorted state of the dataframe is not saved. Use the parameter `inplace = True` to save the sorted state.***

---

In [0]:
# save the sorted state by using inplace =True
data_frame.sort_values(by=['grade','marks'], ascending= [True, False], inplace=True)

In [0]:
data_frame

   roll_no     name grade  marks       city
4      105   Kartik     A     22  Hyderabad
2      104  Prateek     A     20      Delhi
0      102  Aravind     B     15   Gurugram
1      101    Rahul     B     15      Delhi
3      103  Piyuesh     C      4   Gurugram

---

***Now, we can see that the index is also shuffled according to the sorting. If we want to reset the index we use `reset_index` function.***


---

In [0]:
data_frame.reset_index()

   index  roll_no     name grade  marks       city
0      4      105   Kartik     A     22  Hyderabad
1      2      104  Prateek     A     20      Delhi
2      0      102  Aravind     B     15   Gurugram
3      1      101    Rahul     B     15      Delhi
4      3      103  Piyuesh     C      4   Gurugram

---

***Now, it has created another column `index` which is the previous index. If you want to remove this just pass the parameter `drop = True` and also `inplace = True` to save the state.***

---

In [0]:
data_frame.reset_index(inplace=True, drop=True)
data_frame

   roll_no     name grade  marks       city
0      105   Kartik     A     22  Hyderabad
1      104  Prateek     A     20      Delhi
2      102  Aravind     B     15   Gurugram
3      101    Rahul     B     15      Delhi
4      103  Piyuesh     C      4   Gurugram